000100101228     A*****************************************************************
000200101228     A*                                                               *
000300120125     A* Program ID...... MNU0050D                                     *
000400101228     A* Program Desc.... Work With Menu Details                       *
000500101228     A*                                                               *
000600101228     A* Written By...... Greg Cannella                                *
000700101228     A* Date Written.... 12/28/09                                     *
000800101228     A* Log Number...... 1234                                         *
000900101228     A*                                                               *
001000101228     A* Comments........                                              *
001100101228     A*                                                               *
001200101228     A*                                                               *
001300101228     A*****************************************************************
001400101228     A* Compile Options:                                              *
001500101228     A*                                                               *
001600101228     A*                                                               *
001700101228     A*****************************************************************
001800101228     A* Modifications:                                                *
001900101228     A*                                                               *
002000101228     A* Req#  By   Date      Modification                             *
002100101228     A* 1234  XXX  XX/XX/XX                                           *
002200101228     A*                                                               *
002300101228     A*                                                               *
002400101228     A*****************************************************************
002500101228     A*
002600101228     A*
002700101228     A************************
002800101228     A* File level keywords **
002900101228     A************************
003000101230     A                                      DSPSIZ(24 80 *DS3)
003100101230     A                                      PRINT
003200101228     A*
003300101228     A*
003400101228     A***************
003500101228     A* Subfile #1 **
003600101228     A***************
003700101230     A          R SCRNS01                   SFL
003800101230     A            WSUSERH       10A  H
003900101230     A            WSUSER        10A  B  6  6
004000101230     A  40
004100101230     AO 41                                  DSPATR(RI PC)
004200101230     A            WSLUDT         6Y 0O  6 18EDTCDE(Y)
004300101230     A            WSLUTM         6Y 0O  6 28EDTWRD('  :  :  ')
004400101230     A            WSLUUS        10   O  6 38
004500101230     A            WSLUPG        10   O  6 50
004600101228     A*
004700101228     A*
004800101228     A***********************
004900101228     A* Subfile control #1 **
005000101228     A***********************
005100101230     A          R SCRNC01                   SFLCTL(SCRNS01)
005200101230     A                                      SFLSIZ(0400)
005300101230     A                                      SFLPAG(0016)
005400101230     A                                      CF03(03)
005500101230     A                                      CF04(04)
005600101230     A                                      CF05(05)
005700101230     A                                      CF06(06)
005800101230     A                                      CF07(07)
005900101230     A                                      CF08(08)
006000101230     A                                      CF12(12)
006100101230     A                                      ROLLUP(25)
006200101230     A                                      RTNCSRLOC(&HDCSRR &HDCSRF &HDCSRP)
006300101230     A                                      RTNCSRLOC(*WINDOW &HDROW &HDCOL)
006400101230     A                                      OVERLAY
006500101230     A  32                                  SFLDSP
006600101230     A N30                                  SFLDSPCTL
006700101230     A  30                                  SFLCLR
006800101230     A  33                                  SFLINZ
006900101230     A  34                                  SFLEND(*MORE)
007000101230     A            HDSFLP         4S 0H      SFLRCDNBR(CURSOR)
007100101230     A            HDCSRR        10A  H
007200101230     A            HDCSRF        10A  H
007300101230     A            HDCSRP         4S 0H
007400101230     A            HDROW          3S 0H
007500101230     A            HDCOL          3S 0H
007600101230     A            RRN1           4S 0H
007700101230     A                                  1  2'MNU0050R'
007800101230     A                                  1 27'Maintain Security Overrides'
007900101230     A                                      DSPATR(HI)
008000101230     A                                  1 72DATE
008100101230     A                                      EDTCDE(Y)
008200101230     A                                  2 72TIME
008300101230     A                                  5  6'User/Group'
008400101230     A                                      DSPATR(HI)
008500101230     A                                  2  2USER
008600101230     A            WCOPT         10A  O  2 17
008700101230     A            WCDESC        32A  O  2 28
008800101230     A                                  5 30'Time'
008900101230     A                                      DSPATR(HI)
009000101230     A                                  5 40'User'
009100101230     A                                      DSPATR(HI)
009200101230     A                                  5 51'Program'
009300101230     A                                      DSPATR(HI)
009400101230     A                                  4 18'------------- Last Update ---------
009500101230     A                                      --------'
009600101230     A                                  5 20'Date'
009700101230     A                                      DSPATR(HI)
009800101228     A*
009900101228     A*
010000101228     A*****************************
010100101228     A* Command key descriptions **
010200101228     A*****************************
010300101230     A          R SCRNK01
010400101230     A                                      OVERLAY
010500101230     A                                 23  3'F3=Exit'
010600101230     A                                      COLOR(BLU)
010700101230     A                                 23 17'F12=Cancel'
010800101230     A                                      COLOR(BLU)
010900101228     A*
011000101228     A*
011100101228     A*************************************
011200101228     A* Blank format for no records found *
011300101228     A*************************************
011400101228     A          R SCRNR01
011500101228     A                                      OVERLAY
011600101228     A                                 13  2' '
011700101228     A*
011800101228     A*
011900101228     A***********************
012000101228     A* Message subfile #1 **
012100101228     A***********************
012200101228     A          R MSGSFL1                   SFL
012300101228     A                                      SFLMSGRCD(24)
012400101228     A            MSGKEY                    SFLMSGKEY
012500101228     A            DSPGMN                    SFLPGMQ(10)
012600101228     A*
012700101228     A*
012800101228     A*******************************
012900101228     A* Message subfile control #1 **
013000101228     A*******************************
013100101228     A          R MSGCTL1                   SFLCTL(MSGSFL1)
013200101228     A                                      OVERLAY
013300101228     A N30                                  SFLDSP
013400101228     A N30                                  SFLDSPCTL
013500101228     A N30                                  SFLINZ
013600101228     A N30                                  SFLEND
013700101228     A                                      SFLSIZ(0005)
013800101228     A                                      SFLPAG(0001)
013900101228     A            DSPGMN                    SFLPGMQ(10)
