000100101228     A*****************************************************************
000200101228     A*                                                               *
000300120125     A* Program ID...... MNU0055D                                     *
000400101228     A* Program Desc.... Work With Menu Details                       *
000500101228     A*                                                               *
000600101228     A* Written By...... Greg Cannella                                *
000700101228     A* Date Written.... 12/28/09                                     *
000800101228     A* Log Number...... 1234                                         *
000900101228     A*                                                               *
001000101228     A* Comments........                                              *
001100101228     A*                                                               *
001200101228     A*                                                               *
001300101228     A*****************************************************************
001400101228     A* Compile Options:                                              *
001500101228     A*                                                               *
001600101228     A*                                                               *
001700101228     A*****************************************************************
001800101228     A* Modifications:                                                *
001900101228     A*                                                               *
002000101228     A* Req#  By   Date      Modification                             *
002100101228     A* 1234  XXX  XX/XX/XX                                           *
002200101228     A*                                                               *
002300101228     A*                                                               *
002400101228     A*****************************************************************
002500101228     A*
002600101228     A*
002700101228     A************************
002800101228     A* File level keywords **
002900101228     A************************
003000120125     A                                      DSPSIZ(24 80 *DS3)
003100120125     A                                      PRINT
003200101228     A*
003300101228     A*
003400101228     A***************
003500101228     A* Subfile #1 **
003600101228     A***************
003700101230     A          R SCRNS01                   SFL
003800101230     A            WSUSERH       10A  H
003900101230     A            WSUSER        10A  B  6  6
004000101230     A  40
004100101230     AO 41                                  DSPATR(RI PC)
004200101230     A            WSLUDT         6Y 0O  6 18EDTCDE(Y)
004300101230     A            WSLUTM         6Y 0O  6 28EDTWRD('  :  :  ')
004400101230     A            WSLUUS        10   O  6 38
004500101230     A            WSLUPG        10   O  6 50
004600101228     A*
004700101228     A*
004800101228     A***********************
004900101228     A* Subfile control #1 **
005000101228     A***********************
005100120125     A          R SCRNC01                   SFLCTL(SCRNS01)
005200120125     A                                      SFLSIZ(0400)
005300120125     A                                      SFLPAG(0016)
005400120125     A                                      CF03(03)
005500120125     A                                      CF04(04)
005600120125     A                                      CF05(05)
005700120125     A                                      CF06(06)
005800120125     A                                      CF07(07)
005900120125     A                                      CF08(08)
006000120125     A                                      CF12(12)
006100120125     A                                      ROLLUP(25)
006200120125     A                                      RTNCSRLOC(&HDCSRR &HDCSRF &HDCSRP)
006300120125     A                                      RTNCSRLOC(*WINDOW &HDROW &HDCOL)
006400120125     A                                      OVERLAY
006500120125     A  32                                  SFLDSP
006600120125     A N30                                  SFLDSPCTL
006700120125     A  30                                  SFLCLR
006800120125     A  33                                  SFLINZ
006900120125     A  34                                  SFLEND(*MORE)
007000120125     A            HDSFLP         4S 0H      SFLRCDNBR(CURSOR)
007100120125     A            HDCSRR        10A  H
007200120125     A            HDCSRF        10A  H
007300120125     A            HDCSRP         4S 0H
007400120125     A            HDROW          3S 0H
007500120125     A            HDCOL          3S 0H
007600120125     A            RRN1           4S 0H
007700120125     A                                  1  2'MNU0055R'
007800120125     A                                  1 27'Maintain Menu Overrides'
007900120125     A                                      DSPATR(HI)
008000120125     A                                  1 72DATE
008100120125     A                                      EDTCDE(Y)
008200120125     A                                  2 72TIME
008300120125     A                                  5  6'User/Group'
008400120125     A                                      DSPATR(HI)
008500120125     A                                  2  2USER
008600120125     A            WCOPT         10A  O  2 17
008700120125     A            WCDESC        32A  O  2 28
008800120125     A                                  5 30'Time'
008900120125     A                                      DSPATR(HI)
009000120125     A                                  5 40'User'
009100120125     A                                      DSPATR(HI)
009200120125     A                                  5 51'Program'
009300120125     A                                      DSPATR(HI)
009400120125     A                                  4 18'------------- Last Update ---------
009500120125     A                                      --------'
009600120125     A                                  5 20'Date'
009700120125     A                                      DSPATR(HI)
009800120125     A                                  3  4'People or groups on this list have-
009900120125     A                                       the ability to jump to this menu.'
010000120125     A                                      DSPATR(HI)
010100101228     A*
010200101228     A*
010300101228     A*****************************
010400101228     A* Command key descriptions **
010500101228     A*****************************
010600101230     A          R SCRNK01
010700101230     A                                      OVERLAY
010800101230     A                                 23  3'F3=Exit'
010900101230     A                                      COLOR(BLU)
011000101230     A                                 23 17'F12=Cancel'
011100101230     A                                      COLOR(BLU)
011200101228     A*
011300101228     A*
011400101228     A*************************************
011500101228     A* Blank format for no records found *
011600101228     A*************************************
011700101228     A          R SCRNR01
011800101228     A                                      OVERLAY
011900101228     A                                 13  2' '
012000101228     A*
012100101228     A*
012200101228     A***********************
012300101228     A* Message subfile #1 **
012400101228     A***********************
012500101228     A          R MSGSFL1                   SFL
012600101228     A                                      SFLMSGRCD(24)
012700101228     A            MSGKEY                    SFLMSGKEY
012800101228     A            DSPGMN                    SFLPGMQ(10)
012900101228     A*
013000101228     A*
013100101228     A*******************************
013200101228     A* Message subfile control #1 **
013300101228     A*******************************
013400101228     A          R MSGCTL1                   SFLCTL(MSGSFL1)
013500101228     A                                      OVERLAY
013600101228     A N30                                  SFLDSP
013700101228     A N30                                  SFLDSPCTL
013800101228     A N30                                  SFLINZ
013900101228     A N30                                  SFLEND
014000101228     A                                      SFLSIZ(0005)
014100101228     A                                      SFLPAG(0001)
014200101228     A            DSPGMN                    SFLPGMQ(10)
