000100101228     A*****************************************************************
000200101228     A*                                                               *
000300101228     A* Program ID...... MNU0030D                                     *
000400101228     A* Program Desc.... Work With Menu Details                       *
000500101228     A*                                                               *
000600101228     A* Written By...... Greg Cannella                                *
000700101228     A* Date Written.... 12/28/09                                     *
000800101228     A* Log Number...... 1234                                         *
000900101228     A*                                                               *
001000101228     A* Comments........                                              *
001100101228     A*                                                               *
001200101228     A*                                                               *
001300101228     A*****************************************************************
001400101228     A* Compile Options:                                              *
001500101228     A*                                                               *
001600101228     A*                                                               *
001700101228     A*****************************************************************
001800101228     A* Modifications:                                                *
001900101228     A*                                                               *
002000101228     A* Req#  By   Date      Modification                             *
002100101228     A* 1234  XXX  XX/XX/XX                                           *
002200101228     A*                                                               *
002300101228     A*                                                               *
002400101228     A*****************************************************************
002500101228     A*
002600101228     A*
002700101228     A************************
002800101228     A* File level keywords **
002900101228     A************************
003000101230     A                                      DSPSIZ(24 80 *DS3)
003100101230     A                                      PRINT
003200101228     A*
003300101228     A*
003400101228     A***************
003500101228     A* Subfile #1 **
003600101228     A***************
003700101228     A          R SCRNS01                   SFL
003800101229     A            WSSEQH         3  0H
003900101229     A            WSSEQ          3  0B  5  2
004000101229     A  40                                  DSPATR(RI PC)
004100101229     A            WSSELH         4A  H
004200101229     A            WSSEL          4A  B  5  9
004300101229     A            WSOPTH        10   H
004400101229     A            WSOPT         10   B  5 17
004500101229     A  41                                  DSPATR(RI PC)
004600101228     A            WSDESC        32   O  5 29
004700101228     A*
004800101228     A*
004900101228     A***********************
005000101228     A* Subfile control #1 **
005100101228     A***********************
005200101229     A          R SCRNC01                   SFLCTL(SCRNS01)
005300101229     A                                      SFLSIZ(0400)
005400101229     A                                      SFLPAG(0016)
005500101229     A                                      CF03(03)
005600101229     A                                      CF04(04)
005700101229     A                                      CF05(05)
005800101229     A                                      CF06(06)
005900101229     A                                      CF07(07)
006000101230     A                                      CF08(08)
006100101229     A                                      CF12(12)
006200101229     A                                      ROLLUP(25)
006300101229     A                                      RTNCSRLOC(&HDCSRR &HDCSRF &HDCSRP)
006400101230     A                                      RTNCSRLOC(*WINDOW &HDROW &HDCOL)
006500101229     A                                      OVERLAY
006600101229     A  32                                  SFLDSP
006700101229     A N30                                  SFLDSPCTL
006800101229     A  30                                  SFLCLR
006900101229     A  33                                  SFLINZ
007000101229     A  34                                  SFLEND(*MORE)
007100101229     A            HDSFLP         4S 0H      SFLRCDNBR(CURSOR)
007200101229     A            HDCSRR        10A  H
007300101229     A            HDCSRF        10A  H
007400101229     A            HDCSRP         4S 0H
007500101230     A            HDROW          3S 0H
007600101230     A            HDCOL          3S 0H
007700101229     A            RRN1           4S 0H
007800101229     A                                  1  2'MNU0030R'
007900101229     A                                  1 34'Maintain Menu'
008000101229     A                                      DSPATR(HI)
008100101229     A                                  1 72DATE
008200101229     A                                      EDTCDE(Y)
008300101229     A                                  2 72TIME
008400101229     A                                  4  2'Seq'
008500101229     A                                      DSPATR(HI)
008600101229     A                                  2  2USER
008700101229     A            WCMNAME       10A  O  2 17
008800101229     A            WCMDESC       40A  O  2 28
008900101229     A                                  4  7'Selection'
009000101229     A                                      DSPATR(HI)
009100101229     A                                  4 18'Option *'
009200101229     A                                      DSPATR(HI)
009300101229     A                                  4 30'Description'
009400101229     A                                      DSPATR(HI)
009500101228     A*
009600101228     A*
009700101228     A*****************************
009800101228     A* Command key descriptions **
009900101228     A*****************************
010000101230     A          R SCRNK01
010100101230     A                                      OVERLAY
010200101230     A                                 22  3'F3=Exit'
010300101230     A                                      COLOR(BLU)
010400101230     A                                 22 13'F4=Prompt(*)'
010500101230     A                                      COLOR(BLU)
010600101230     A                                 22 41'F6=Add New Option'
010700101230     A                                      COLOR(BLU)
010800101230     A                                 22 28'F5=Refresh'
010900101230     A                                      COLOR(BLU)
011000101230     A                                 22 61'F7=Change Option'
011100101230     A                                      COLOR(BLU)
011200101230     A                                 23  3'F8=Maintain Options'
011300101230     A                                      COLOR(BLU)
011400101228     A*
011500101228     A*
011600101228     A*************************************
011700101228     A* Blank format for no records found *
011800101228     A*************************************
011900101228     A          R SCRNR01
012000101228     A                                      OVERLAY
012100101228     A                                 13  2' '
012200101228     A*
012300101228     A*
012400101228     A***********************
012500101228     A* Message subfile #1 **
012600101228     A***********************
012700101228     A          R MSGSFL1                   SFL
012800101228     A                                      SFLMSGRCD(24)
012900101228     A            MSGKEY                    SFLMSGKEY
013000101228     A            DSPGMN                    SFLPGMQ(10)
013100101228     A*
013200101228     A*
013300101228     A*******************************
013400101228     A* Message subfile control #1 **
013500101228     A*******************************
013600101228     A          R MSGCTL1                   SFLCTL(MSGSFL1)
013700101228     A                                      OVERLAY
013800101228     A N30                                  SFLDSP
013900101228     A N30                                  SFLDSPCTL
014000101228     A N30                                  SFLINZ
014100101228     A N30                                  SFLEND
014200101228     A                                      SFLSIZ(0005)
014300101228     A                                      SFLPAG(0001)
014400101228     A            DSPGMN                    SFLPGMQ(10)
