000100101224     A*****************************************************************
000200101224     A*                                                               *
000300101224     A* Program ID...... MNU0001D                                     *
000400101224     A* Program Desc.... Menu Processing Program                      *
000500101224     A*                                                               *
000600101224     A* Written By...... Greg Cannella                                *
000700101224     A* Date Written.... 12/24/10                                     *
000800101224     A* Log Number...... 1234                                         *
000900101224     A*                                                               *
001000101224     A* Comments........                                              *
001100101224     A*                                                               *
001200101224     A*                                                               *
001300101224     A*****************************************************************
001400101224     A* Compile Options:                                              *
001500101224     A*                                                               *
001600101224     A*                                                               *
001700101224     A*****************************************************************
001800101224     A* Modifications:                                                *
001900101224     A*                                                               *
002000101224     A* Req#  By   Date      Modification                             *
002100101224     A* 1234  XXX  XX/XX/XX                                           *
002200101224     A*                                                               *
002300101224     A*                                                               *
002400101224     A*****************************************************************
002500101224     A*
002600101224     A*
002700101224     A************************
002800101224     A* File level keywords **
002900101224     A************************
003000111018     A*%%EC
003100111018     A                                      DSPSIZ(24 80 *DS3)
003200111018     A                                      PRINT
003300101224     A*
003400101224     A*****************************
003500101224     A* Headings                 **
003600101224     A*****************************
003700101224     A          R SCRNH01
003800101224     A                                  1 72DATE
003900101224     A                                      EDTCDE(Y)
004000101224     A                                  2 72TIME
004100101224     A            WCHEAD1       40   O  1 16
004200101224     A                                  1 60USER
004300101229     A            DSJOB         10   O  2 60
004400101224     A            WCMENU        10   O  1  2DSPATR(HI)
004500101229     A            WCSYSTEM       8   O  2  2
004600101224     A            WCHEAD2       40   O  2 16DSPATR(HI)
004700101224     A            WCMNUDESC     40   O  3 16
004800101224     A*
004900101224     A*
005000101224     A***************
005100101224     A* Subfile #1 **
005200101224     A***************
005300111018     A          R SCRNS01                   SFL
005400111018     A            WSLINE        38A  O  5  2
005500111018     A  40                                  DSPATR(HI)
005600120125     A            WSOPT         10A  H
005700101224     A*
005800101224     A*
005900101224     A***********************
006000101224     A* Subfile control #1 **
006100101224     A***********************
006200111018     A          R SCRNC01                   SFLCTL(SCRNS01)
006300111018     A*%%TS  SD  20111018  131003  GREGC       REL-V6R1M0  5761-WDS
006400111018     A  *DS3                                SFLLIN(0001)
006500111018     A                                      SFLSIZ(0029)
006600111018     A                                      SFLPAG(0028)
006700111018     A                                      CF01(01)
006800111018     A                                      CF02(02)
006900111018     A                                      CF03(03)
007000111018     A  61                                  CF04(04)
007100120125     A  61                                  CF06(06)
007200111018     A                                      CF09(09)
007300111018     A  61                                  CF10(10)
007400111018     A  61                                  CF11(11)
007500111018     A                                      CF12(12)
007600111018     A  61                                  CF20(20)
007700111018     A  61                                  CF21(21)
007800111018     A  61                                  CF22(22)
007900111018     A  61                                  CF23(23)
008000111018     A                                      ROLLUP(25)
008100111018     A                                      RTNCSRLOC(&HDCSRR &HDCSRF &HDCSRP)
008200120125     A                                      RTNCSRLOC(*WINDOW &HDROW &HDCOL)
008300111018     A                                      OVERLAY
008400111018     A  32                                  SFLDSP
008500111018     A N30                                  SFLDSPCTL
008600111018     A  30                                  SFLCLR
008700111018     A  34                                  SFLEND(*MORE)
008800111018     A            RRN1           4S 0H
008900111018     A            HDSFLP         4S 0H      SFLRCDNBR(CURSOR)
009000111018     A            HDCSRR        10A  H
009100111018     A            HDCSRF        10A  H
009200111018     A            HDCSRP         4S 0H
009300120125     A            HDROW          3S 0H
009400120125     A            HDCOL          3S 0H
009500111018     A                                 20  2'Selection:'
009600111018     A                                      DSPATR(HI)
009700111018     A            WCCMD         66A  B 20 13DSPATR(HI)
009800111018     A                                      DSPATR(PC)
009900111018     A                                 22 18'F3=Home Menu'
010000111018     A                                      COLOR(BLU)
010100111018     A  61                             22 41'F4=Prompt'
010200111018     A                                      COLOR(BLU)
010300120125     A                                 22 61'F6=Customize Menu'
010400120125     A                                      COLOR(BLU)
010500111018     A  61                             23 41'F22=Menu Maint'
010600111018     A                                      COLOR(BLU)
010700111018     A  61                             23 61'F23=Users'
010800111018     A                                      COLOR(BLU)
010900111018     A  61                             23 18'F21=Search Menus'
011000111018     A                                      COLOR(BLU)
011100111018     A  61                             23  2'F20=Chg User'
011200111018     A                                      COLOR(BLU)
011300111018     A                                 22  2'F2=Display Msg'
011400111018     A                                      COLOR(BLU)
011500101224     A*
011600101224     A*
011700101224     A*************************************
011800101224     A* Blank format for no records found *
011900101224     A*************************************
012000101224     A          R SCRNR01
012100101224     A                                      OVERLAY
012200101224     A                                 13  2' '
012300101227     A*************************************
012400101227     A* Blank format for no records found *
012500101227     A*************************************
012600101224     A*
012700101229     A          R PROMPT
012800101229     A                                      CF03(03)
012900101229     A                                      CF12(12)
013000101229     A            WRPHEAD       50A  O  1 16DSPATR(HI)
013100101229     A                                  1 72DATE
013200101229     A                                      EDTCDE(Y)
013300101229     A                                  2  2USER
013400101229     A                                  2 72TIME
013500101229     A            WRPBODY      400A  O  5  1
013600101229     A                                 22 20'F12=Cancel'
013700101229     A                                      COLOR(BLU)
013800101229     A                                 22  2'F3=Exit'
013900101229     A                                      COLOR(BLU)
014000101229     A            WRMOPT        10A  O  1  2
014100101229     A                                 20  2'Press'
014200101229     A                                      COLOR(BLU)
014300101229     A                                 20  8'ENTER'
014400101229     A                                      COLOR(WHT)
014500101229     A                                 20 14'to continue to run this option.'
014600101229     A                                      COLOR(BLU)
014700101230     A* Blank format for no records found *
014800101230     A*************************************
014900101230     A*
015000101230     A*         R PROMPT
015100101230     A          R CHGUSER
015200101230     A                                      CF03(03)
015300101230     A                                      CF12(12)
015400101230     A                                  1 72DATE
015500101230     A                                      EDTCDE(Y)
015600101230     A                                  2  2USER
015700101230     A                                  2 72TIME
015800101230     A                                 22 20'F12=Cancel'
015900101230     A                                      COLOR(BLU)
016000101230     A                                 22  2'F3=Exit'
016100101230     A                                      COLOR(BLU)
016200101230     A            WRMOPT        10A  O  1  2
016300101230     A                                  1 35'Change User'
016400101230     A                                      DSPATR(HI)
016500101230     A                                  5  3'User:'
016600101230     A                                      DSPATR(HI)
016700101230     A            WRCHGUSER     10   B  5  9
016800101230     A                                  8  5'Type in a user name to test the me-
016900101230     A                                      nu system as they would see it.'
017000101224     A*
017100101224     A***********************
017200101224     A* Message subfile #1 **
017300101224     A***********************
017400101224     A          R MSGSFL1                   SFL
017500101224     A                                      SFLMSGRCD(24)
017600101224     A            MSGKEY                    SFLMSGKEY
017700101224     A            DSPGMN                    SFLPGMQ(10)
017800101224     A*
017900101224     A*
018000101224     A*******************************
018100101224     A* Message subfile control #1 **
018200101224     A*******************************
018300101224     A          R MSGCTL1                   SFLCTL(MSGSFL1)
018400101224     A                                      OVERLAY
018500101224     A N30                                  SFLDSP
018600101224     A N30                                  SFLDSPCTL
018700101224     A N30                                  SFLINZ
018800101224     A N30                                  SFLEND
018900101224     A                                      SFLSIZ(0005)
019000101224     A                                      SFLPAG(0001)
019100101224     A            DSPGMN                    SFLPGMQ(10)
